{
  "class_name": "Sequential",
  "config": {
    "name": "mfcc",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 40, 862, 1],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "conv2d_8_input"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_8",
          "trainable": true,
          "batch_input_shape": [null, 40, 862, 1],
          "dtype": "float32",
          "filters": 16,
          "kernel_size": [2, 2],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_8",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_8",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_9",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [2, 2],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_9",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_9",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_10",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [2, 2],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_10",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_10",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_11",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [2, 2],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_11",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_11",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "GlobalAveragePooling2D",
        "config": {
          "name": "global_average_pooling2d_2",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last",
          "keepdims": false
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "dtype": "float32",
          "units": 2,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      }
    ]
  },
  "keras_version": "2.9.0",
  "backend": "tensorflow"
}
